Repository: OxiazozouO/XnbConverter
Catalog: XnbConverter.Core/Error.*.resx
Languages: de, hu, it, ja, ko, pt, zh

# XNB.1
source: Buffer is empty
de: Puffer ist leer
hu: A puffer üres
it: Il buffer è vuoto
ja: バッファが空です
ko: 버퍼가 비어 있습니다
pt: O buffer está vazio
zh: 缓冲区为空

# XNB.2
source: Invalid file magic value, expected XNB, actual value is {0}
de: Ungültiger Datei-Magic-Wert, erwartet XNB, tatsächlicher Wert ist {0}
hu: Érvénytelen fájl-mágikus érték, várt XNB, tényleges érték {0}
it: Valore magico del file non valido, previsto XNB, valore effettivo è {0}
ja: 無効なファイルマジック値、XNBが期待されており、実際の値は{0}です
ko: 잘못된 파일 매직 값, 예상값은 XNB이고 실제 값은 {0}입니다
pt: Valor mágico do arquivo inválido, esperado XNB, valor atual é {0}
zh: 无效的文件魔术值，期望值为XNB，实际值为{0}

# XNB.3
source: XNB file has been truncated!
de: XNB-Datei wurde abgeschnitten!
hu: Az XNB fájl levágva!
it: Il file XNB è stato troncato!
ja: XNBファイルが切り捨てられました！
ko: XNB 파일이 잘렸습니다!
pt: O arquivo XNB foi truncado!
zh: XNB文件已被截断！

# XNB.4
source: Unexpected shared resource ({0}).
de: Unerwartete gemeinsame Ressource ({0}).
hu: Váratlan megosztott erőforrás ({0}).
it: Risorsa condivisa inaspettata ({0}).
ja: 予期せぬ共有リソース ({0})。
ko: 예기치 않은 공유된 리소스 ({0})。
pt: Recurso compartilhado inesperado ({0}).
zh: 意外的共享资源（{0}）。

# XNB.5
source: Invalid object!
de: Ungültiges Objekt!
hu: Érvénytelen objektum!
it: Oggetto non valido!
ja: 無効なオブジェクト！
ko: 유효하지 않은 객체!
pt: Objeto inválido!
zh: 无效的对象！

# XNB.6
source: Invalid file export!
de: Ungültiger Dateiexport!
hu: Érvénytelen fájlekimenet!
it: Esportazione file non valida!
ja: 無効なファイルエクスポート！
ko: 유효하지 않은 파일 내보내기!
pt: Exportação de arquivo inválida!
zh: 无效的文件导出！

# XNB.7
source: Invalid JSON file format: {0}
de: Ungültiges JSON-Dateiformat: {0}
hu: Érvénytelen JSON fájlformátum: {0}
it: Formato file JSON non valido: {0}
ja: 無効なJSONファイル形式: {0}
ko: 잘못된 JSON 파일 형식: {0}
pt: Formato de arquivo JSON inválido: {0}
zh: 无效的JSON文件格式: {0}

# XNB.8
source: The {0} file is empty.
de: {0}-Datei ist leer.
hu: {0} fájl üres.
it: Il file {0} è vuoto.
ja: {0} ファイルが空です。
ko: {0} 파일이 비어 있습니다.
pt: O arquivo {0} está vazio.
zh: {0} 文件为空。

# XNB.9
source: {0} is missing the 'content' field.
de: {0} fehlt das Feld 'content'.
hu: {0}-nak hiányzik a 'content' mező.
it: A {0} manca il campo 'content'.
ja: {0} に 'content' フィールドが不足しています。
ko: {0}에 'content' 필드가 없습니다.
pt: {0} está faltando o campo 'content'.
zh: {0} 缺少 'content' 字段。

# XNB.10
source: Reading file '{0}'...
de: Lese Datei '{0}'...
hu: '{0}' fájl olvasása...
it: Lettura del file '{0}'...
ja: ファイル'{0}'を読み込んでいます...
ko: 파일 '{0}' 읽는 중...
pt: Lendo arquivo '{0}'...
zh: 正在读取文件 '{0}' ……

# XNB.11
source: XNB file validation successful!
de: XNB-Dateiüberprüfung erfolgreich!
hu: XNB fájl ellenőrzése sikeres!
it: Convalida del file XNB riuscita!
ja: XNBファイルの検証に成功しました！
ko: XNB 파일 유효성 검사 성공!
pt: Validação do arquivo XNB bem-sucedida!
zh: XNB文件验证成功！

# XNB.12
source: Successfully read XNB file!
de: XNB-Datei erfolgreich gelesen!
hu: XNB fájl sikeresen olvasva!
it: Lettura del file XNB riuscita!
ja: XNBファイルの読み取りに成功しました！
ko: XNB 파일 읽기 성공!
pt: Arquivo XNB lido com sucesso!
zh: 成功读取XNB文件！

# XNB.13
source: Exporting {0}...
de: Exportiere {0}...
hu: {0} exportálása folyamatban...
it: In fase di esportazione di {0}...
ja: {0} をエクスポート中...
ko: {0}을 내보내는 중...
pt: Exportando {0}...
zh: 正在导出 {0}...

# XNB.14
source: Found valid XNB magic value!
de: Gültigen XNB-Magic-Wert gefunden!
hu: Érvényes XNB mágikus érték megtalálva!
it: Trovato valore magico XNB valido!
ja: 有効なXNBマジック値が見つかりました！
ko: 유효한 XNB 매직 값 발견!
pt: Encontrado valor mágico XNB válido!
zh: 找到有效的XNB魔术值！

# XNB.15
source: Target platform: {0}
de: Zielplattform: {0}
hu: Célplatform: {0}
it: Piattaforma di destinazione: {0}
ja: ターゲットプラットフォーム：{0}
ko: 대상 플랫폼: {0}
pt: Plataforma de destino: {0}
zh: 目标平台：{0}

# XNB.16
source: XNB format version: XNA Game Studio 3.{0}
hu: XNB formátum verzió: XNA Game Studio 3.{0}
it: Versione del formato XNB: XNA Game Studio 3.{0}
ja: XNB形式バージョン：XNA Game Studio 3.{0}
ko: XNB 형식 버전: XNA Game Studio 3.{0}
pt: Versão do formato XNB: XNA Game Studio 3.{0}
zh: XNB格式版本：XNA Game Studio 3.{0}

# XNB.17
source: Compression: {0}
de: Komprimierung: {0}
hu: Tömörítés: {0}
it: Compressione: {0}
ja: 圧縮：{0}
ko: 압축: {0}
pt: Compressão: {0}
zh: 压缩：{0}

# XNB.18
source: File size: {0} bytes.
de: Dateigröße: {0} Bytes.
hu: Fájlméret: {0} bájt.
it: Dimensione del file: {0} byte.
ja: ファイルサイズ：{0} バイト。
ko: 파일 크기: {0} 바이트.
pt: Tamanho do arquivo: {0} bytes.
zh: 文件大小：{0} 字节。

# XNB.19
source: Decompressed size: {0} bytes.
de: Dekomprimierte Größe: {0} Bytes.
hu: Kicsomagolt méret: {0} bájt.
it: Dimensione dopo decompressione: {0} byte.
ja: 解凍後のサイズ：{0} バイト。
ko: 압축 해제 후 크기: {0} 바이트.
pt: Tamanho descompactado: {0} bytes.
zh: 解压缩后大小：{0} 字节。

# XNB.20
source: Reading from byte position: {0}
de: Lesen ab Byte-Position: {0}
hu: Olvasás bájt pozícióból: {0}
it: Lettura dalla posizione byte: {0}
ja: バイト位置から読み取り：{0}
ko: 바이트 위치에서 읽기: {0}
pt: Lendo da posição do byte: {0}
zh: 从字节位置读取：{0}

# XNB.21
source: Reader count: {0}
de: Anzahl der Leser: {0}
hu: Olvasók száma: {0}
it: Numero di lettori: {0}
ja: リーダーの数：{0}
ko: 리더 개수: {0}
pt: Quantidade de leitores: {0}
zh: 读取器数量：{0}

# XNB.22
source: Shared resource count: {0}
de: Anzahl der gemeinsam genutzten Ressourcen: {0}
hu: Megosztott erőforrások száma: {0}
it: Numero di risorse condivise: {0}
ja: 共有リソース数：{0}
ko: 공유 리소스 수: {0}
pt: Quantidade de recursos compartilhados: {0}
zh: 共享资源数量：{0}

# XNB.23
source: Invalid target platform found {0}.
de: Ungültige Zielplattform gefunden {0}.
hu: Érvénytelen célplatform található {0}.
it: Trovata piattaforma di destinazione non valida {0}.
ja: 無効なターゲットプラットフォームが見つかりました{0}。
ko: 유효하지 않은 대상 플랫폼 {0} 발견.
pt: Plataforma de destino inválida encontrada {0}.
zh: 找到无效的目标平台{0}。

# XNB.24
source: Unknown XNB format version {0}.
de: Unbekannte XNB-Formatversion {0}.
hu: Ismeretlen XNB formátum verzió {0}.
it: Versione sconosciuta del formato XNB {0}.
ja: 未知のXNB形式バージョン {0}。
ko: 알 수 없는 XNB 형식 버전 {0}.
pt: Versão desconhecida do formato XNB {0}.
zh: 未知的XNB格式版本 {0}。

# Process.1
source: Output file saved: {0}
de: Ausgabedatei gespeichert: {0}
hu: Kimeneti fájl mentve: {0}
it: File di output salvato: {0}
ja: 出力ファイルが保存されました：{0}
ko: 출력 파일 저장됨: {0}
pt: Arquivo de saída salvo: {0}
zh: 输出文件已保存：{0}

# Process.2
source: File {0} cannot be saved!
de: Datei {0} kann nicht gespeichert werden!
hu: {0} fájl nem menthető!
it: Impossibile salvare il file {0}!
ja: ファイル {0} を保存できません！
ko: {0} 파일을 저장할 수 없습니다!
pt: O arquivo {0} não pode ser salvo!
zh: 文件{0}无法保存！

# Process.3
source: Filename: {0} {1}
de: Dateiname: {0} {1}
hu: Fájlnév: {0} {1}
it: Nome file: {0} {1}
ja: ファイル名：{0} {1}
ko: 파일 이름: {0} {1}
pt: Nome do arquivo: {0} {1}
zh: 文件名：{0} {1}

# Process.4
source: Filename: {0} {1} {2}
de: Dateiname: {0} {1} {2}
hu: Fájlnév: {0} {1} {2}
it: Nome file: {0} {1} {2}
ja: ファイル名：{0} {1} {2}
ko: 파일 이름: {0} {1} {2}
pt: Nome do arquivo: {0} {1} {2}
zh: 文件名：{0} {1} {2}

# Program.1
source: Optional: Enable concurrency
de: [Optional] Parallele Ausführung aktivieren
hu: [Opcionális] Párhuzamos végrehajtás engedélyezése
it: [Opzionale] Abilita la concorrenza
ja: [オプション] 並行実行を有効にする
ko: [선택 사항] 병렬 실행 활성화
pt: [Opcional] Habilitar concorrência
zh: [可选]是否开启并发

# Program.2
source: [Required] Input file or folder
de: [Erforderlich] Eingabedatei oder -ordner
hu: [Kötelező] Bemeneti fájl vagy mappa
it: [Obbligatorio] File o cartella di input
ja: [必須] 入力ファイルまたはフォルダ
ko: [필수] 입력 파일 또는 폴더
pt: [Obrigatório] Arquivo ou pasta de entrada
zh: [必填]输入的文件或文件夹

# Program.3
source: [Required] Output folder
de: [Erforderlich] Ausgabeordner
hu: [Kötelező] Kimeneti mappa
it: [Obbligatorio] Cartella di output
ja: [必須] 出力フォルダ
ko: [필수] 출력 폴더
pt: [Obrigatório] Pasta de saída
zh: [必填]输出的文件夹

# Program.4
source: Automatically pack and unpack XNB files based on input
de: XNB-Dateien automatisch basierend auf der Eingabe verpacken und entpacken
hu: XNB fájlok automatikus csomagolása és kicsomagolása a bemenet alapján
it: Imballare e sballare automaticamente i file XNB in base all'input
ja: 入力に基づいてXNBファイルを自動的にパックおよびアンパック
ko: 입력에 따라 XNB 파일을 자동으로 패킹 및 언패킹
pt: Empacotar e desempacotar automaticamente arquivos XNB com base na entrada
zh: 根据输入的文件自动拆装xnb

# Program.5
source: Unpack
de: Entpacken
hu: Kicsomagolás
it: Scompattare
ja: 解凍
ko: 압축 해제
pt: Desempacotar
zh: 解包

# Program.6
source: Pack
de: Packen
hu: Csomagolás
it: Impacchettare
ja: パック
ko: 패킹
pt: Empacotar
zh: 打包

# Program.7
source: bad command
de: Ungültiger Befehl
hu: Rossz parancs
it: Comando errato
ja: 無効なコマンド
ko: 잘못된 명령
pt: Comando inválido
zh: 错误命令

# Program.8
source: Catch Exception:
de: Fange Ausnahme:
hu: Kivétel elkapása:
it: Cattura eccezione:
ja: 例外をキャッチ:
ko: 예외 잡기:
pt: Capturar exceção:
zh: 捕获异常:

# BufferReader.1
source: '{0}' not found!
de: '{0}' nicht gefunden!
hu: '{0}' nem található!
it: '{0}' non trovato!
ja: '{0}' が見つかりません！
ko: '{0}'을(를) 찾을 수 없습니다!
pt: '{0}' não encontrado!
zh: '{0}'不存在！

# BufferReader.2
source: Buffer search out of range! {0} ~ {1}
de: Puffersuche außerhalb des Bereichs! {0} ~ {1}
hu: Pufferkeresés kívül esik a tartományon! {0} ~ {1}
it: Ricerca buffer fuori range! {0} ~ {1}
ja: バッファ検索が範囲外です！ {0} ~ {1}
ko: 버퍼 검색이 범위를 벗어났습니다! {0} ~ {1}
pt: Busca de buffer fora de alcance! {0} ~ {1}
zh: 缓冲区寻找超出范围！ {0} ~ {1}

# ReaderResolver.1
source: Invalid reader index {0}
de: Ungültiger Reader-Index {0}
hu: Érvénytelen olvasó index {0}
it: Indice lettore non valido {0}
ja: 無効なリーダーインデックス {0}
ko: 잘못된 리더 인덱스 {0}
pt: Índice de leitor inválido {0}
zh: 无效的读取器索引 {0}

# ReaderResolver.2
source: Reader not found, index: {0}
de: Reader nicht gefunden, Index: {0}
hu: Olvasó nem található, index: {0}
it: Lettore non trovato, indice: {0}
ja: リーダーが見つかりません、インデックス：{0}
ko: 리더를 찾을 수 없습니다, 인덱스: {0}
pt: Leitor não encontrado, índice: {0}
zh: 找不到读取器, 索引：{0}

# FileUtils.1
source: Invalid output path {0} {1}
de: Ungültiger Ausgabepfad {0} {1}
hu: Érvénytelen kimeneti útvonal {0} {1}
it: Percorso di output non valido {0} {1}
ja: 無効な出力パス{0} {1}
ko: 잘못된 출력 경로 {0} {1}
pt: Caminho de saída inválido {0} {1}
zh: 无效的输出路径{0} {1}

# FileUtils.2
source: Invalid input path: {0}
de: Ungültiger Eingabepfad: {0}
hu: Érvénytelen bemeneti útvonal: {0}
it: Percorso di input non valido: {0}
ja: 無効な入力パス: {0}
ko: 잘못된 입력 경로: {0}
pt: Caminho de entrada inválido: {0}
zh: 无效的输入路径: {0}

# TypeReadHelper.1
source: Unimplemented type: {0} {1}
de: Nicht implementierter Typ: {0} {1}
hu: Megvalósítatlan típus: {0} {1}
it: Tipo non implementato: {0} {1}
ja: 未実装のタイプ：{0} {1}
ko: 구현되지 않은 유형: {0} {1}
pt: Tipo não implementado: {0} {1}
zh: 尚未实现的类型：{0} {1}

# TypeReadHelper.2
source: Error occurred while obtaining reader! Please check the assembly: {0} Whether the corresponding DLL file path exists, or if the path is correctly written to the {1} file. The DLL file may be {2}.dll Error message: {3}
de: Fehler beim Abrufen des Lesers! Bitte überprüfen Sie die Assembly: {0} Ob der entsprechende DLL-Dateipfad vorhanden ist oder ob der Pfad korrekt in die Datei {1} geschrieben wurde. Die DLL-Datei könnte {2}.dll sein Fehlermeldung: {3}
hu: Hiba történt az olvasó beszerzése közben! Kérjük, ellenőrizze az összeszerelést: {0} Hogy a megfelelő DLL-fájl elérési útja létezik-e, vagy hogy a {1} fájlba a helyes útvonal van-e írva. A DLL-fájl lehet {2}.dll Hibajelzés: {3}
it: Errore durante il recupero del lettore! Si prega di controllare l'assembly: {0} Se il percorso del file DLL corrispondente esiste o se il percorso è correttamente scritto nel file {1}. Il file DLL potrebbe essere {2}.dll Messaggio di errore: {3}
ja: リーダーの取得中にエラーが発生しました！ アセンブリを確認してください: {0} 対応するDLLファイルパスが存在するか、またはパスが {1} ファイルに正しく書き込まれているかどうかを確認してください。 DLLファイルは {2}.dll かもしれません エラーメッセージ: {3}
ko: 리더를 가져오는 동안 오류가 발생했습니다! 어셈블리를 확인하십시오: {0} 해당 DLL 파일 경로가 있는지 또는 경로가 {1} 파일에 올바르게 작성되었는지 확인하십시오. DLL 파일은 {2}.dll 일 수 있습니다 오류 메시지: {3}
pt: Erro ao obter o leitor! Por favor, verifique a montagem: {0} Se o caminho do arquivo DLL correspondente existe, ou se o caminho está corretamente escrito no arquivo {1}. O arquivo DLL pode ser {2}.dll Mensagem de erro: {3}
zh: 获取读取器时发生错误！ 请检查程序集: {0} 对应的dll文件路径是否存在，或者路径是否正确写入到 {1} 文件中。 dll文件可能为 {2}.dll 错误信息: {3}

# TypeReadHelper.3
source: Unimplemented type: {0}
de: Nicht implementierter Typ: {0}
hu: Megvalósítatlan típus: {0}
it: Tipo non implementato: {0}
ja: 未実装のタイプ: {0}
ko: 구현되지 않은 유형: {0}
pt: Tipo não implementado: {0}
zh: 未实现的类型：{0}

# TypeReadHelper.4
source: Class not loaded: {0}!
de: Klasse nicht geladen: {0}!
hu: Nem betöltött osztály: {0}!
it: Classe non caricata: {0}!
ja: 読み込まれていないクラス: {0}!
ko: 로드되지 않은 클래스: {0}!
pt: Classe não carregada: {0}!
zh: 未加载的类：{0}！

# TypeReadHelper.5
source: {0} does not exist, DLL loading failed, which may result in unsuccessful xnb parsing, Please modify the correct file path to {1}
de: {0} existiert nicht, DLL-Datei konnte nicht geladen werden, was zu einer erfolglosen XNB-Analyse führen kann, Bitte ändern Sie den korrekten Dateipfad in {1}
hu: {0} nem létezik, a DLL betöltése sikertelen volt, ami sikertelen xnb elemzéshez vezethet, Kérjük, módosítsa a helyes fájlutat {1}-re
it: {0} non esiste, il caricamento della DLL è fallito, il che può comportare un'analisi xnb non riuscita, Si prega di modificare il percorso del file corretto in {1}
ja: {0} が存在しません、DLLの読み込みに失敗し、xnbの解析が失敗する可能性があります、 {1} に正しいファイルパスを修正してください
ko: {0}가 존재하지 않습니다, DLL 로드에 실패하여 xnb 구문 분석이 실패할 수 있습니다, 올바른 파일 경로를 {1}로 수정하세요
pt: {0} não existe, falha ao carregar DLL, o que pode resultar em análise xnb malsucedida, Por favor, modifique o caminho do arquivo correto para {1}
zh: {0} 不存在，dll加载失败，可能导致解析xnb不成功， 请把正确的文件路径修改到{1}

# SpriteFont.1
source: Parse file failed
de: Datei konnte nicht analysiert werden
hu: Fájl elemzése sikertelen
it: Analisi del file non riuscita
ja: ファイルの解析に失敗しました
ko: 파일 분석 실패
pt: Falha ao analisar o arquivo
zh: 解析文件失败

# EnumReader.1
source: value {0} does not correspond to any enum member.
de: Wert {0} entspricht keinem Enum-Mitglied.
hu: az érték {0} nem felel meg egyetlen enumerációs taghoz sem.
it: il valore {0} non corrisponde a nessun membro dell'enumerazione.
ja: 値 {0} は、列挙型のメンバーに対応していません。
ko: 값 {0}은(는) 열거형 멤버와 일치하지 않습니다.
pt: o valor {0} não corresponde a nenhum membro de enumeração.
zh: 值 {0} 不对应任何枚举成员。

# Texture2DReader.1
source: Texture2D format type ECT1 not implemented!
de: Texture2D-Formattyp ECT1 nicht implementiert!
hu: A Texture2D formátumú ECT1 típus nincs implementálva!
it: Tipo di formato Texture2D ECT1 non implementato!
ja: Texture2D形式のECT1タイプは実装されていません！
ko: Texture2D 형식 유형 ECT1이 구현되지 않았습니다!
pt: Tipo de formato Texture2D ECT1 não implementado!
zh: Texture2D格式类型ECT1未实现！

# Texture2DReader.2
source: Unimplemented Texture2D format type ({0}).
de: Nicht implementierter Texture2D-Formattyp ({0}) gefunden.
hu: Nem implementált Texture2D formátumtípus található ({0}).
it: Trovato tipo di formato Texture2D non implementato ({0}).
ja: 未実装のTexture2D形式タイプが見つかりました（{0}）。
ko: 구현되지 않은 Texture2D 형식 유형({0})을(를) 찾았습니다.
pt: Tipo de formato Texture2D não implementado encontrado ({0}).
zh: 找到未实现的Texture2D格式类型（{0}）。

# Texture2DReader.3
source: Image Width: {0}, Height: {1}, Format: {2}
de: Bildbreite: {0}, Höhe: {1}, Format: {2}
hu: Kép szélessége: {0}, Magasság: {1}, Formátum: {2}
it: Larghezza immagine: {0}, Altezza: {1}, Formato: {2}
ja: 画像 幅: {0}, 高さ: {1}, フォーマット: {2}
ko: 이미지 너비: {0}, 높이: {1}, 형식: {2}
pt: Largura da imagem: {0}, Altura: {1}, Formato: {2}
zh: 图片 宽: {0}, 高: {1}, 格式: {2}

# Texture2DReader.4
source: Found mipcount for {0}, only the first will be used.
de: Mip-Zähler für {0} gefunden. Es wird nur der erste verwendet.
hu: {0} mip-számító található, csak az első lesz használatban.
it: Trovato il conteggio di mip di {0}, verrà utilizzato solo il primo.
ja: {0} の mipcount が見つかりました、最初のもののみが使用されます。
ko: {0}의 mipcount를 찾았습니다. 첫 번째 것만 사용됩니다.
pt: Encontrado mipcount de {0}, apenas o primeiro será usado.
zh: 找到 {0} 的 mipcount，将只使用第一个。

# LayerReader.1
source: Max value of i is {0}, current value is {1}
de: Maximalwert von i ist {0}, aktueller Wert ist {1}
hu: i maximális értéke {0}, jelenlegi értéke {1}
it: Il valore massimo di i è {0}, il valore attuale è {1}
ja: i の最大値は {0} で、現在の値は {1} です
ko: i의 최대값은 {0}이며 현재 값은 {1}입니다.
pt: O valor máximo de i é {0}, o valor atual é {1}
zh: i 的最大值为 {0}，当前值为 {1}

# LayerReader.2
source: Tile data error
de: Fehler bei den Kachelndaten
hu: Csempe adatok hibásak
it: Errore nei dati del mosaico
ja: タイルデータエラー
ko: 타일 데이터 오류
pt: Erro nos dados do azulejo
zh: 瓦片数据错误

# PropertieReader.1
source: Invalid map property type: {0}
de: Ungültiger Karteneigenschaftstyp: {0}
hu: Hibás térkép tulajdonság típus: {0}
it: Tipo di proprietà mappa errato: {0}
ja: 誤ったマッププロパティの種類：{0}
ko: 잘못된 지도 속성 유형 : {0}
pt: Tipo de propriedade de mapa incorreto: {0}
zh: 错误的地图属性类型：{0}

# TBin10Reader.1
source: Xnb does not currently support Tbin maps with more than {0} layers, currently {1} layers
de: Xnb unterstützt derzeit keine Tbin-Karten mit mehr als {0} Ebenen, derzeit {1} Ebenen
hu: Az Xnb jelenleg nem támogatja a {0} rétegnél több Tbin térképet, jelenleg {1} réteg
it: Xnb non supporta mappe Tbin con più di {0} livelli, attualmente {1} livelli
ja: Xnbは現在、{0}層を超えるTbinマップをサポートしていません。現在の層数は{1}です。
ko: Xnb는 현재 {0}층을 초과하는 Tbin 지도를 지원하지 않습니다. 현재 {1}층
pt: Xnb atualmente não suporta mapas Tbin com mais de {0} camadas, atualmente {1} camadas
zh: Xnb尚未支持超过{0}层的Tbin地图，目前{1}层

# TBin10Reader.2
source: Unknown program error
de: Unbekannter Programmfehler
hu: Ismeretlen programhiba
it: Errore di programma sconosciuto
ja: 不明なプログラムエラー
ko: 알 수 없는 프로그램 오류
pt: Erro de programa desconhecido
zh: 未知程序错误

# LZX.1
source: Window size out of range!
de: Fenstergröße außerhalb des Bereichs!
hu: Az ablak mérete túllépi a határokat!
it: Dimensioni finestra al di fuori del range!
ja: ウィンドウサイズが範囲外です！
ko: 창 크기가 범위를 벗어남!
pt: Tamanho da janela fora do alcance!
zh: 窗口大小超出范围！

# LZX.2
source: Intel E8 call found, invalid for XNB file.
de: Intel E8-Aufruf gefunden, ungültig für XNB-Datei.
hu: Intel E8 hívás észlelve, érvénytelen XNB fájlra.
it: Chiamata Intel E8 trovata, non valida per il file XNB.
ja: Intel E8呼び出しが見つかりました、XNBファイルには無効です。
ko: Intel E8 호출이 발견되었습니다. XNB 파일에는 유효하지 않습니다.
pt: Chamada Intel E8 encontrada, inválida para o arquivo XNB.
zh: 发现Intel E8调用，对于XNB文件无效。

# LZX.3
source: Invalid block type found: {0}
de: Ungültiger Blocktyp gefunden: {0}
hu: Érvénytelen blokk típus észlelve: {0}
it: Tipo di blocco non valido trovato: {0}
ja: 無効なブロックタイプが見つかりました: {0}
ko: 유효하지 않은 블록 유형 발견: {0}
pt: Tipo de bloco inválido encontrado: {0}
zh: 发现无效的块类型: {0}

# LZX.4
source: Cannot run outside the window frame.
de: Kann nicht außerhalb des Fensterrahmens ausgeführt werden.
hu: Nem lehet futtatni az ablakkereten kívül.
it: Impossibile eseguire al di fuori del telaio della finestra.
ja: ウィンドウの外で実行できません。
ko: 창 프레임 외부에서 실행할 수 없습니다.
pt: Não é possível executar fora da moldura da janela.
zh: 无法在窗框外运行。

# LZX.5
source: Out of range! {0} {1} {2}
de: Überlauf! {0} {1} {2}
hu: Túlcsordulás! {0} {1} {2}
it: Sovraccarico! {0} {1} {2}
ja: オーバーラン！{0} {1} {2}
ko: 범위를 벗어남! {0} {1} {2}
pt: Transbordamento! {0} {1} {2}
zh: 超出范围！{0} {1} {2}

# LZX.6
source: Specified block type invalid!
de: Ungültiger Blocktyp angegeben!
hu: Érvénytelen blok típus megadva!
it: Tipo di blocco specificato non valido!
ja: 指定されたブロックタイプは無効です！
ko: 지정된 블록 유형이 잘못되었습니다!
pt: Tipo de bloco especificado inválido!
zh: 指定的块类型无效！

# LZX.7
source: EOF reached, data still remaining.
de: EOF erreicht, Daten sind noch übrig.
hu: EOF elérve, még adat maradt.
it: EOF raggiunto, ci sono ancora dati rimasti.
ja: EOFに到達しましたが、データが残っています。
ko: EOF에 도달했지만 데이터가 남아 있습니다.
pt: EOF atingido, ainda há dados restantes.
zh: EOF已到达，数据还有剩余。

# LZX.8
source: Table overflow!
de: Tabellenüberlauf!
hu: Táblakiszivárgás!
it: Sovraccarico tabella!
ja: テーブルオーバーフロー！
ko: 표 오버플로우!
pt: Transbordamento de tabela!
zh: 表溢出！

# LZX.9
source: Table overflow during decoding.
de: Tabellenüberlauf während der Decodierung.
hu: Táblakiszivárgás a dekódolás közben.
it: Sovraccarico tabella durante la decodifica.
ja: デコード中にテーブルオーバーフローが発生しました。
ko: 디코딩 중 표 오버플로우가 발생했습니다.
pt: Transbordamento de tabela durante a decodificação.
zh: 解码过程中表格溢出。

# LZX.10
source: Decoding table did not reach table mask.
de: Entschlüsselungstabelle hat den Tabellenmaskenwert nicht erreicht.
hu: A dekódoló tábla nem érte el a táblamaszkot.
it: La tabella di decodifica non ha raggiunto il valore della maschera della tabella.
ja: 解読表がテーブルマスクに達していません。
ko: 해독 표가 표 마스크에 도달하지 않았습니다.
pt: A tabela de decodificação não atingiu a máscara de tabela.
zh: 解码表未达到表掩码。

# LZX.11
source: Invalid size read in compressed content.
de: Ungültige Größe beim Lesen des komprimierten Inhalts.
hu: Érvénytelen méret a tömörített tartalom olvasásakor.
it: Dimensione non valida durante la lettura del contenuto compresso.
ja: 圧縮されたコンテンツの読み取りサイズが無効です。
ko: 압축된 내용을 읽는 중에 유효하지 않은 크기입니다.
pt: Tamanho inválido ao ler o conteúdo comprimido.
zh: 压缩内容中读取的大小无效。

# LZX.12
source: File successfully decompressed!
de: Datei erfolgreich dekomprimiert!
hu: Fájl sikeresen kicsomagolva!
it: File decompresso con successo!
ja: ファイルが正常に解凍されました！
ko: 파일이 성공적으로 압축 해제되었습니다!
pt: Arquivo descompactado com sucesso!
zh: 文件已成功解压缩！

# LZX.13
source: Extra digits: {0}
de: Zusätzliche Stellen: {0}
hu: További számjegyek: {0}
it: Cifre aggiuntive: {0}
ja: 追加桁数：{0}
ko: 추가 자릿수: {0}
pt: Dígitos adicionais: {0}
zh: 额外位数：{0}

# LZX.14
source: Position base: {0}
de: Positionsgrundlage: {0}
hu: Pozíciós alap: {0}
it: Base posizione: {0}
ja: 位置基準：{0}
ko: 위치 기본값: {0}
pt: Base de posição: {0}
zh: 位置基址：{0}

# LZX.15
source: Intel: {0} = {1}
ja: インテル: {0} = {1}
ko: 인텔: {0} = {1}
zh: 英特尔: {0} = {1}

# LZX.16
source: Block type: {0} = {1}
de: Blocktyp: {0} = {1}
hu: Blokk típusa: {0} = {1}
it: Tipo di blocco: {0} = {1}
ja: ブロックタイプ: {0} = {1}
ko: 블록 유형: {0} = {1}
pt: Tipo de bloco: {0} = {1}
zh: 块类型: {0} = {1}

# LZX.17
source: Remaining block byte count: {0}
de: Verbleibende Blockbyte-Anzahl: {0}
hu: Hátralévő blokk bájtok száma: {0}
it: Numero di byte di blocco rimanenti: {0}
ja: 残りのブロックバイト数：{0}
ko: 남은 블록 바이트 수: {0}
pt: Contagem de bytes de bloco restante: {0}
zh: 剩余块字节数: {0}

# LZX.18
source: Position: {0}, Bit mask: {1}, Table mask: {2}
de: Position: {0}, Bitmaske: {1}, Tabellenmaske: {2}
hu: Pozíció: {0}, Bitmaszk: {1}, Táblázat maszk: {2}
it: Posizione: {0}, Maschera di bit: {1}, Maschera di tabella: {2}
ja: 位置：{0}、ビットマスク：{1}、テーブルマスク：{2}
ko: 위치: {0}, 비트 마스크: {1}, 테이블 마스크: {2}
pt: Posição: {0}, Máscara de bits: {1}, Máscara de tabela: {2}
zh: 位置: {0}，位掩码: {1}，表掩码: {2}

# LZX.19
source: Bit count: {0}, Bit string: {1}
de: Bitanzahl: {0}, Bitzeichenfolge: {1}
hu: Bit száma: {0}, Bit karakterlánc: {1}
it: Conteggio bit: {0}, Stringa di bit: {1}
ja: ビット数：{0}、ビット文字列：{1}
ko: 비트 수: {0}, 비트 문자열: {1}
pt: Contagem de bits: {0}, String de bits: {1}
zh: 位数: {0}，位串: {1}

# LZX.20
source: Symbol: {0}, Symbol string: {1}
de: Symbol: {0}, Symbolzeichenfolge: {1}
hu: Szimbólum: {0}, Szimbólumkarakterlánc: {1}
it: Simbolo: {0}, Stringa di simboli: {1}
ja: シンボル：{0}、シンボル文字列：{1}
ko: 기호: {0}, 기호 문자열: {1}
pt: Símbolo: {0}, String de símbolo: {1}
zh: 符号: {0}，符号串: {1}

# LZX.21
source: --------Block size: {0}, Frame size: {1}
de: --------Blockgröße: {0}, Rahmengröße: {1}
hu: --------Blokk mérete: {0}, Keret mérete: {1}
it: --------Dimensione blocco: {0}, Dimensione telaio: {1}
ja: --------ブロックサイズ：{0}、フレームサイズ：{1}
ko: --------블록 크기: {0}, 프레임 크기: {1}
pt: --------Tamanho do bloco: {0}, Tamanho do quadro: {1}
zh: --------块大小：{0}，框架大小：{1}

# AudioEngineReader.1
source: Invalid magic value found, {0}
de: Ungültiger Magiewert gefunden, {0}
hu: Érvénytelen varázsló érték található, {0}
it: Valore magico non valido trovato, {0}
ja: 無効なマジック値が見つかりました、{0}
ko: 잘못된 매직 값 발견, {0}
pt: Valor mágico inválido encontrado, {0}
zh: 发现无效的魔术值, {0}

# AudioEngineReader.2
source: Tool version: {0}
hu: Eszköz verzió: {0}
it: Versione dello strumento: {0}
ja: ツールバージョン：{0}
ko: 도구 버전: {0}
pt: Versão da ferramenta: {0}
zh: 工具版本: {0}
