Repository: OxiazozouO/XnbConverter
Catalog: XnbConverter.Core/Error.*.resx
Languages: de, hu, it, ja, ko, pt, zh

# AudioEngineReader.3
source: Format version: {0}
hu: Formátum verzió: {0}
it: Versione del formato: {0}
ja: フォーマットバージョン：{0}
ko: 형식 버전: {0}
pt: Versão do formato: {0}
zh: 格式版本：{0}

# AudioEngineReader.4
source: Category: {0}, Variable: {1}
de: Kategorie: {0}, Variable: {1}
hu: Kategória: {0}, Változó: {1}
it: Categoria: {0}, Variabile: {1}
ja: カテゴリ：{0}、変数：{1}
ko: 분류: {0}, 변수: {1}
pt: Categoria: {0}, Variável: {1}
zh: 类别：{0}, 变量：{1}

# AudioEngineReader.6
source: DSP preset: {0}
de: DSP-Voreinstellung: {0}
hu: DSP előbeállítás: {0}
it: Impostazione predefinita DSP: {0}
ja: DSPプリセット：{0}
ko: DSP 프리셋: {0}
pt: Preset DSP: {0}
zh: DSP预设: {0}

# AudioEngineReader.7
source: DSP parameters: {0}
de: DSP-Parameter: {0}
hu: DSP paraméterek: {0}
it: Parametri DSP: {0}
ja: DSPパラメータ：{0}
ko: DSP 매개 변수: {0}
pt: Parâmetros DSP: {0}
zh: DSP参数: {0}

# AudioEngineReader.8
source: Category offset: {0}
de: Kategorieoffset: {0}
hu: Kategória eltolás: {0}
it: Offset di categoria: {0}
ja: カテゴリオフセット: {0}
ko: 카테고리 오프셋: {0}
pt: Deslocamento de categoria: {0}
zh: 类别偏移量: {0}

# AudioEngineReader.9
source: Variable offset: {0}
de: Variablenoffset: {0}
hu: Változó eltolás: {0}
it: Offset variabile: {0}
ja: 変数オフセット: {0}
ko: 변수 오프셋: {0}
pt: Deslocamento de variável: {0}
zh: 变量偏移量: {0}

# AudioEngineReader.10
source: Category name index offset: {0}
de: Kategoriename-Indexoffset: {0}
hu: Kategórianév index eltolás: {0}
it: Offset indice nome categoria: {0}
ja: カテゴリ名インデックスオフセット: {0}
ko: 카테고리 이름 인덱스 오프셋: {0}
pt: Deslocamento de índice de nome de categoria: {0}
zh: 类别名称索引偏移量: {0}

# AudioEngineReader.11
source: Variable name index offset: {0}
de: Variablenname-Indexoffset: {0}
hu: Változónév index eltolás: {0}
it: Offset indice nome variabile: {0}
ja: 変数名インデックスオフセット: {0}
ko: 변수 이름 인덱스 오프셋: {0}
pt: Deslocamento de índice de nome de variável: {0}
zh: 变量名称索引偏移量: {0}

# AudioEngineReader.12
source: Category name offset: {0}
de: Kategoriename-Offset: {0}
hu: Kategória név eltolás: {0}
it: Offset nome categoria: {0}
ja: カテゴリ名オフセット: {0}
ko: 카테고리 이름 오프셋: {0}
pt: Deslocamento de nome de categoria: {0}
zh: 类别名称偏移量: {0}

# AudioEngineReader.13
source: Variable name offset: {0}
de: Variablenname-Offset: {0}
hu: Változónév eltolás: {0}
it: Offset nome variabile: {0}
ja: 変数名オフセット: {0}
ko: 변수 이름 오프셋: {0}
pt: Deslocamento de nome de variável: {0}
zh: 变量名称偏移量: {0}

# AudioEngineReader.14
source: RPC offset: {0}
hu: RPC eltolás: {0}
it: Offset RPC: {0}
ja: RPCオフセット: {0}
ko: RPC 오프셋: {0}
pt: Deslocamento de RPC: {0}
zh: RPC偏移量: {0}

# AudioEngineReader.15
source: DSP preset offset: {0}
de: DSP-Voreinstellung-Offset: {0}
hu: DSP előbeállítás eltolás: {0}
it: Offset preset DSP: {0}
ja: DSPプリセットオフセット: {0}
ko: DSP 프리셋 오프셋: {0}
pt: Deslocamento de predefinição DSP: {0}
zh: DSP预设偏移量: {0}

# AudioEngineReader.16
source: DSP parameter offset: {0}
hu: DSP paraméter eltolás: {0}
it: Offset parametro DSP: {0}
ja: DSPパラメーターオフセット: {0}
ko: DSP 파라미터 오프셋: {0}
pt: Deslocamento de parâmetro DSP: {0}
zh: DSP参数偏移量: {0}

# AudioEngineReader.17
source: Category: {0}
de: Kategorie: {0}
hu: Kategória: {0}
it: Categoria: {0}
ja: カテゴリ: {0}
ko: 카테고리: {0}
pt: Categoria: {0}
zh: 类别: {0}

# AudioEngineReader.18
source: Variable: {0}
hu: Változó: {0}
it: Variabile: {0}
ja: 変数: {0}
ko: 변수: {0}
pt: Variável: {0}
zh: 变量: {0}

# AudioEngineReader.19
source: Unsupported XGS format!
de: Nicht unterstütztes XGS-Format!
hu: Nem támogatott XGS formátum!
it: Formato XGS non supportato!
ja: サポートされていないXGS形式です！
ko: 지원되지 않는 XGS 형식입니다!
pt: Formato XGS não suportado!
zh: 不支持的XGS格式！

# SoundBankReader.2
source: Last modification time low: {0}, Last modification time high: {1}
de: Niedriges Änderungsdatum: {0}, Hohes Änderungsdatum: {1}
hu: Utolsó módosítás alacsony része: {0}, Utolsó módosítás magas része: {1}
it: Parte bassa dell'ultima data di modifica: {0}, Parte alta dell'ultima data di modifica: {1}
ja: 最終変更時間の下位: {0}, 最終変更時間の上位: {1}
ko: 최종 수정 날짜 하위: {0}, 최종 수정 날짜 상위: {1}
pt: Parte baixa da última data de modificação: {0}, Parte alta da última data de modificação: {1}
zh: 最后修改时间低位: {0}, 最后修改时间高位: {1}

# SoundBankReader.3
source: Platform: {0}
de: Plattform: {0}
it: Piattaforma: {0}
ja: プラットフォーム：{0}
ko: 플랫폼: {0}
pt: Plataforma: {0}
zh: 平台: {0}

# SoundBankReader.4
source: Simple hints: {0}
de: Einfache Hinweise: {0}
hu: Egyszerű jelzések száma: {0}
it: Numero di indizi semplici: {0}
ja: 単純なヒントの数： {0}
ko: 간단한 힌트 수: {0}
pt: Número de dicas simples: {0}
zh: 简单提示数: {0}

# SoundBankReader.5
source: Complex hints: {0}
de: Komplexe Hinweise: {0}
hu: Komplex jelzések száma: {0}
it: Numero di indizi complessi: {0}
ja: 複雑なヒントの数： {0}
ko: 복잡한 힌트 수: {0}
pt: Número de dicas complexas: {0}
zh: 复杂提示数: {0}

# SoundBankReader.6
source: Total hints: {0}
de: Gesamtanzahl der Hinweise: {0}
hu: Összes jelzés száma: {0}
it: Numero totale di indizi: {0}
ja: 合計ヒント数： {0}
ko: 총 힌트 수: {0}
pt: Número total de dicas: {0}
zh: 总提示数: {0}

# SoundBankReader.7
source: Waveform libraries: {0}
de: Anzahl der Waveform-Bibliotheken: {0}
hu: Hullámforma könyvtárak száma: {0}
it: Numero di librerie di forme d'onda: {0}
ja: ウェーブフォームライブラリの数： {0}
ko: 웨이브폼 라이브러리 수: {0}
pt: Número de bibliotecas de formas de onda: {0}
zh: 波形库数: {0}

# SoundBankReader.8
source: Number of sounds: {0}
de: Anzahl der Klänge: {0}
hu: Hangok száma: {0}
it: Numero di suoni: {0}
ja: 音の数： {0}
ko: 사운드 수: {0}
pt: Número de sons: {0}
zh: 声音数: {0}

# SoundBankReader.9
source: Cue name table length: {0}
de: Länge der Cue-Namensliste: {0}
hu: Cue névtábla hossza: {0}
it: Lunghezza della tabella dei nomi delle cue: {0}
ja: Cue名テーブルの長さ： {0}
ko: Cue 이름 테이블 길이: {0}
pt: Comprimento da tabela de nomes de cue: {0}
zh: Cue名称表长度: {0}

# SoundBankReader.10
source: Simple hint sound offset: {0}
de: Einfacher Hinweistonversatz: {0}
hu: Egyszerű jelzés hangeltolás: {0}
it: Spostamento del suono dell'indizio semplice: {0}
ja: 単純なヒント音のオフセット： {0}
ko: 간단한 힌트 사운드 오프셋: {0}
pt: Deslocamento de som de dica simples: {0}
zh: 简单提示音偏移量: {0}

# SoundBankReader.11
source: Complex hint sound offset: {0}
de: Komplexer Hinweistonversatz: {0}
hu: Komplex jelzés hangeltolás: {0}
it: Spostamento del suono dell'indizio complesso: {0}
ja: 複雑なヒント音のオフセット： {0}
ko: 복잡한 힌트 사운드 오프셋: {0}
pt: Deslocamento de som de dica complexa: {0}
zh: 复杂提示音偏移量: {0}

# SoundBankReader.12
source: Sound offset for names: {0}
de: Ton-Offset für Namen: {0}
hu: Hangnév eltolása: {0}
it: Spostamento nome suono: {0}
ja: サウンド名オフセット: {0}
ko: 사운드 이름 오프셋: {0}
pt: Deslocamento do nome do som: {0}
zh: 提示音名称偏移量: {0}

# SoundBankReader.13
source: Variation table offset: {0}
de: Variationstabelle Offset: {0}
hu: Variáció tábla eltolása: {0}
it: Spostamento tabella variazioni: {0}
ja: 変化テーブルオフセット: {0}
ko: 변화 테이블 오프셋: {0}
pt: Deslocamento da tabela de variação: {0}
zh: 变化表偏移量: {0}

# SoundBankReader.14
source: Waveform library name table offset: {0}
de: Wellenform-Bibliotheksnamen-Tabellenversatz: {0}
hu: Hullámforma könyvtár neve tábla eltolása: {0}
it: Spostamento tabella nomi della libreria delle forme d'onda: {0}
ja: 波形ライブラリ名テーブルオフセット: {0}
ko: 웨이브폼 라이브러리 이름 테이블 오프셋: {0}
pt: Deslocamento da tabela de nomes da biblioteca de formas de onda: {0}
zh: 波形库名称表偏移量: {0}

# SoundBankReader.15
source: Sound name hash table offset: {0}
de: Tonnamen-Hash-Tabelle Versatz: {0}
hu: Hangnév hash tábla eltolása: {0}
it: Spostamento tabella hash nome suono: {0}
ja: サウンド名ハッシュテーブルオフセット: {0}
ko: 사운드 이름 해시 테이블 오프셋: {0}
pt: Deslocamento da tabela hash do nome do som: {0}
zh: 提示音名称哈希表偏移量: {0}

# SoundBankReader.16
source: Sound name hash value offset: {0}
de: Tonnamen-Hash-Wert-Versatz: {0}
hu: Hangnév hash érték eltolása: {0}
it: Spostamento valore hash nome suono: {0}
ja: サウンド名ハッシュ値オフセット: {0}
ko: 사운드 이름 해시 값 오프셋: {0}
pt: Deslocamento do valor de hash do nome do som: {0}
zh: 提示音名称哈希值偏移量: {0}

# SoundBankReader.17
source: Sound offset: {0}
de: Tonversatz: {0}
hu: Hang eltolása: {0}
it: Spostamento suono: {0}
ja: サウンドオフセット: {0}
ko: 소리 오프셋: {0}
pt: Deslocamento do som: {0}
zh: 声音偏移量: {0}

# SoundBankReader.18
source: Name: {0}
hu: Név: {0}
it: Nome: {0}
ja: 名前: {0}
ko: 이름: {0}
pt: Nome: {0}
zh: 名字: {0}

# SoundBankReader.19
source: Wave Banks: {0}
hu: Hullám bankok: {0}
it: Banche onde: {0}
ja: ウェーブバンク: {0}
ko: 웨이브 뱅크: {0}
pt: Bancos de ondas: {0}
zh: 波形库：{0}

# SoundBankReader.20
source: Cues: {0}
de: Hinweise: {0}
hu: Jelzések: {0}
it: Suggerimenti: {0}
ja: キュー: {0}
ko: 큐: {0}
pt: Dicas: {0}
zh: 提示：{0}

# SoundBankReader.21
source: Found {0}
de: {0} gefunden
hu: Talált {0}
it: {0} trovato
ja: {0} が見つかりました
ko: {0} 발견
pt: {0} encontrado
zh: 发现 {0}

# SoundBankReader.22
source: Found {1} cues for {0}
de: {0} gefunden {1} Hinweise
hu: {0} talált {1} jelzéseket
it: {1} indizi trovati per {0}
ja: {0} に {1} 個のキューが見つかりました
ko: {0}을(를) 위해 {1}개의 큐 발견
pt: Encontradas {1} dicas para {0}
zh: 为 {0} 发现 {1} 个提示音

# SoundBankReader.23
source: WaveBank Index: {0}
it: Indice di WaveBank: {0}
ja: WaveBank インデックス: {0}
ko: WaveBank 인덱스: {0}
pt: Índice do WaveBank: {0}
zh: WaveBank 索引: {0}

# SoundBankReader.24
source: Found {0} cues!
de: Gefundene {0} Hinweise!
hu: {0} hangjelzés találva!
it: Trovati {0} indizi!
ja: {0}個のキューが見つかりました！
ko: {0} 개의 큐 발견!
pt: {0} pistas encontradas!
zh: 发现 {0} 个提示音！

# SoundBankReader.25
source: Unsupported SoundBank format {0}.
de: Nicht unterstütztes SoundBank-Format {0}.
hu: Nem támogatott SoundBank formátum {0}.
it: Formato SoundBank non supportato {0}.
ja: サポートされていない SoundBank 形式 {0}。
ko: 지원되지 않는 SoundBank 형식 {0}.
pt: Formato de SoundBank não suportado {0}.
zh: 不支持的 SoundBank 格式 {0}。

# XactClipReader.1
source: Offset: {0}
de: Versatz: {0}
hu: Eltolás: {0}
ja: オフセット：{0}
ko: 오프셋: {0}
pt: Deslocamento: {0}
zh: 偏移量：{0}

# XactClipReader.2
source: Track: {0}
de: Spur: {0}
hu: Sáv: {0}
it: Traccia: {0}
ja: トラック：{0}
ko: 트랙: {0}
pt: Faixa: {0}
zh: 音轨：{0}

# XactClipReader.3
source: Event Play Wave Pitch Volume Filter Variation
de: Ereignis Wiedergabe Welle Tonhöhe Lautstärke Filter Variation
hu: Esemény Lejátszás Hullám Hangmagasság Hangerő Szűrő Variáció
it: Evento Riproduzione Onda Tonalità Volume Filtro Variazione
ja: イベント プレイ ウェーブ ピッチ ボリューム フィルタ 変化
ko: 이벤트 재생 파형 음정 볼륨 필터 변화
pt: Evento Reproduzir Onda Tom Volume Filtro Variação
zh: 事件 播放 波形 音调 音量 滤波 变化

# XactSoundReader.1
source: Extra Data Length: {0}
de: Zusätzliche Datengröße: {0}
hu: Extra Adat Hossz: {0}
it: Lunghezza Dati Aggiuntivi: {0}
ja: 追加データの長さ: {0}
ko: 추가 데이터 길이: {0}
pt: Comprimento dos Dados Extras: {0}
zh: 额外数据长度: {0}

# XactSoundReader.2
source: Track Index: {0}
de: Spurindex: {0}
hu: Sávindex: {0}
it: Indice Traccia: {0}
ja: トラック インデックス: {0}
ko: 트랙 인덱스: {0}
pt: Índice da Faixa: {0}
zh: 轨道索引: {0}

# FmtChunk.1
source: For SoundEffect, only wav files in Pcm format are supported. The current format is {0}
de: Für SoundEffect werden nur WAV-Dateien im PCM-Format unterstützt. Das aktuelle Format ist {0}
hu: A SoundEffect csak PCM formátumú wav fájlokat támogat, jelenlegi formátum: {0}
it: Per SoundEffect, sono supportati solo file wav in formato Pcm. Il formato attuale è {0}
ja: SoundEffectでは、Pcm形式のwavファイルのみサポートされています。現在の形式は{0}です
ko: SoundEffect는 Pcm 형식의 wav 파일만 지원됩니다. 현재 형식은 {0}입니다
pt: Para SoundEffect, somente são suportados arquivos WAV no formato Pcm. O formato atual é {0}
zh: 对于SoundEffect仅支持Pcm格式的wav，目前的格式为{0}

# FmtChunk.2
source: For Xact, only wav files in Pcm or AdpcmMs format are supported. The current format is {0}
de: Für Xact werden nur WAV-Dateien im PCM- oder AdpcmMs-Format unterstützt. Das aktuelle Format ist {0}
hu: Az Xact esetében csak PCM vagy AdpcmMs formátumú wav fájlok támogatottak. Jelenlegi formátum: {0}
it: Per Xact, sono supportati solo file wav nei formati Pcm o AdpcmMs. Il formato attuale è {0}
ja: Xactでは、PcmまたはAdpcmMs形式のwavファイルのみサポートされています。現在の形式は{0}です
ko: Xact는 Pcm 또는 AdpcmMs 형식의 wav 파일만 지원됩니다. 현재 형식은 {0}입니다
pt: Para Xact, somente são suportados arquivos WAV nos formatos Pcm ou AdpcmMs. O formato atual é {0}
zh: 对于Xact，仅支持Pcm或AdpcmMs格式的wav，目前的格式为{0}

# FmtChunk.3
source: Not a supported type for the game!
de: Nicht unterstützter Dateityp für das Spiel!
hu: Nem támogatott játékfájltípus!
it: Non è un tipo supportato dal gioco!
ja: ゲームでサポートされていないタイプです！
ko: 지원되지 않는 게임 유형입니다!
pt: Não é um tipo suportado pelo jogo!
zh: 不是游戏支持的类型！

# WaveBank.1
source: - flags {0}- file_num {1}- bank name {2}- entry meta size {3}- entry name size {4}- alignment {5}
de: - Flags {0}- Dateianzahl {1}- Bankname {2}- Eintrag Metadaten Größe {3}- Eintragsnamen Größe {4}- Ausrichtung {5}
hu: - zászlók {0}- fájlok száma {1}- bank neve {2}- bejegyzés meta mérete {3}- bejegyzés név mérete {4}- igazítás {5}
it: - flags {0}- numero di file {1}- nome della banca {2}- dimensione metadati voce {3}- dimensione nome voce {4}- allineamento {5}
ja: - フラグ {0}- ファイル数 {1}- バンク名 {2}- エントリメタデータのサイズ {3}- エントリ名のサイズ {4}- アラインメント {5}
ko: - 플래그 {0}- 파일 수 {1}- 뱅크 이름 {2}- 항목 메타 데이터 크기 {3}- 항목 이름 크기 {4}- 정렬 {5}
pt: - bandeiras {0}- número de arquivos {1}- nome do banco {2}- tamanho da meta de entrada {3}- tamanho do nome de entrada {4}- alinhamento {5}
zh: - 标志 {0} - 文件数 {1} - 波形库名称 {2} - 条目元数据大小 {3} - 条目名称大小 {4} - 对齐 {5}

# WaveBank.2
source: - Entry Meta Data Element Size is small
de: - Die Größe des Meta-Datenelements ist zu klein
hu: - A meta adatelem mérete kicsi
it: - La dimensione dell'elemento di dati meta è piccola
ja: - エントリメタデータ要素のサイズが小さいです
ko: - 항목 메타 데이터 요소 크기가 작습니다
pt: - O tamanho do elemento de dados meta é pequeno
zh: - 条目元数据元素大小太小

# FmtChunkReader.1
source: Invalid WAV format: {0}, should be fmt
de: Ungültiges WAV-Format: {0}, sollte fmt sein
hu: Érvénytelen WAV formátum: {0}, fmt kellene legyen
it: Formato WAV non valido: {0}, dovrebbe essere fmt
ja: 無効なWAV形式：{0}、fmtである必要があります
ko: 잘못된 WAV 형식: {0}, fmt여야 합니다
pt: Formato WAV inválido: {0}, deveria ser fmt
zh: 无效的 WAV 格式：{0}，应为 fmt

# RIFFChunkReader.1
source: Invalid WAV format: {0}, should be RIFF
de: Ungültiges WAV-Format: {0}, sollte RIFF sein
hu: Érvénytelen WAV formátum: {0}, RIFF kellene legyen
it: Formato WAV non valido: {0}, dovrebbe essere RIFF
ja: 無効なWAV形式：{0}、RIFFである必要があります
ko: 잘못된 WAV 형식: {0}, RIFF여야 합니다
pt: Formato WAV inválido: {0}, deveria ser RIFF
zh: 无效的 WAV 格式：{0}，应为 RIFF

# RIFFChunkReader.2
source: Invalid wav format: {0}, should be WAVE
de: Ungültiges WAV-Format: {0}, sollte WAVE sein
hu: Érvénytelen wav formátum: {0}, WAVE kellene legyen
it: Formato wav non valido: {0}, dovrebbe essere WAVE
ja: 無効なWAV形式：{0}、WAVEである必要があります
ko: 잘못된 WAV 형식: {0}, WAVE여야 합니다
pt: Formato de arquivo WAV inválido: {0}, deveria ser WAVE
zh: 无效的wav格式：{0}，应为WAVE

# WaveBankReader.1
source: - signature: {0} big/network endian values
de: - Signatur: {0} big/Netzwerk-Byte-Reihenfolgenwerte
hu: - aláírás: {0} nagy/hálózati byte-sorrend értékek
it: - firma: {0} valori big/Network endian
ja: - シグネチャ：{0} ビッグ/ネットワークエンディアン値
ko: - 서명 : {0} big/네트워크 엔디안 값
pt: - assinatura: {0} valores big/Rede endian
zh: - 签名：{0} 大/网络字节顺序值

# WaveBankReader.2
source: - signature: {0} little/intel endian values
de: - Signatur: {0} little/Intel-Byte-Reihenfolgenwerte
hu: - aláírás: {0} kis/intel byte-sorrend értékek
it: - firma: {0} valori little/Intel endian
ja: - シグネチャ：{0} リトル/インテルエンディアン値
ko: - 서명 : {0} little/인텔 엔디안 값
pt: - assinatura: {0} valores little/Intel endian
zh: - 签名：{0} 小/英特尔字节顺序值

# WaveBankReader.3
source: - version : {0}
hu: - verzió: {0}
it: - versione: {0}
ja: - バージョン : {0}
ko: - 버전 : {0}
pt: - versão: {0}
zh: - 版本 : {0}

# WaveBankReader.4
source: Number Size Format SamplingRate Channels BitDepth Output Path
de: Nummer Größe Format Abtastrate Kanäle Bit-Tiefe Ausgabe-Pfad
hu: Szám Méret Formátum Mintaátmérő Kanalok Bitmélység Kimeneti elérési út
it: Numero Dimensione Formato Frequenza di campionamento Canali Profondità in bit Percorso di output
ja: 番号 サイズ フォーマット サンプリングレート チャンネル ビット深度 出力パス
ko: 번호 크기 포맷 샘플링률 채널 비트 깊이 출력 경로
pt: Número Tamanho Formato Taxa de amostragem Canais Profundidade em bits Caminho de saída
zh: 编号 大小 格式 采样率 声道 位深度 输出路径

# WaveBankReader.5
source: offset : {0},format : {1},flags : {2},region_offset : {3},region_length : {4}
de: Versatz : {0}, Format : {1}, Flaggen : {2}, Bereichsversatz : {3}, Bereichslänge : {4}
hu: eltolás : {0}, formátum : {1}, zászlók : {2}, régió eltolása : {3}, régió hossza : {4}
it: offset : {0}, formato : {1}, flag : {2}, offset regione : {3}, lunghezza regione : {4}
ja: オフセット : {0}、フォーマット : {1}、フラグ : {2}、領域オフセット : {3}、領域の長さ : {4}
ko: 오프셋 : {0}, 형식 : {1}, 플래그 : {2}, 영역 오프셋 : {3}, 영역 길이 : {4}
pt: offset : {0}, formato : {1}, flags : {2}, offset de região : {3}, comprimento de região : {4}
zh: 偏移 : {0}, 格式 : {1}, 标志 : {2}, 区域偏移 : {3}, 区域长度 : {4}

# WaveBankReader.6
source: - segment : {0} offset : {1} length : {2}({3})
de: - Segment: {0} Offset {1} Länge: {2} ({3})
hu: - Szegmens: {0} Eltolás {1} Hossz: {2} ({3})
it: - Segmento: {0} Spostamento {1} Lunghezza: {2} ({3})
ja: - セグメント：{0} オフセット {1} 長さ：{2}（{3}）
ko: - 세그먼트: {0} 오프셋{1} 길이: {2}({3})
pt: - Segmento: {0} Deslocamento {1} Comprimento: {2} ({3})
zh: - 片段：{0} 偏移量{1} 长度：{2}({3})

# Texture2DReader.5
source: The dimension represented by the width and height of the Texture2D does not match the data size. Current width: {0}, height: {1}, data size: {2}
de: Die durch die Breite und Höhe der Texture2D dargestellte Dimension stimmt nicht überein mit der Datagröße. Aktuelle Breite: {0}, Höhe: {1}, Datagröße: {2}
hu: A Texture2D szélessége és magassága által reprezentált dimenzió nem egyezik meg az adattaggal. Jelenlegi szélesség: {0}, magasság: {1}, adattag mérete: {2}
ja: Texture2D の幅と高さで表される次元とデータサイズが一致しません。現在の幅: {0}、高さ: {1}、データサイズ: {2}
ko: Texture2D의 너비와 높이로 표현된 차원과 데이터 크기가 일치하지 않습니다. 현재 너비: {0}, 높이: {1}, 데이터 크기: {2}
pt: A dimensão representada pela largura e altura da Texture2D não corresponde ao tamanho dos dados. Largura atual: {0}, altura: {1}, tamanho dos dados: {2}
zh: 纹理2D宽度和高度所表示的维度与数据大小不匹配错误，当前 宽度：{0}，高度：{1}，数据大小：{2}
